In [29]:
import pandas as pd
df = pd.read_csv('agora.csv')

In [30]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [31]:
df.shape

(50, 5)

# Max Absolute Scaler

In [32]:
from sklearn.preprocessing import MaxAbsScaler

In [33]:
mas = MaxAbsScaler()

In [34]:
mas_fit = mas.fit(df[['Marketing Spend']])

In [35]:
mas_fit

MaxAbsScaler()

In [36]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [37]:
df['Marketing Spend'] = mas.fit_transform(df[['Marketing Spend']])

In [38]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [39]:
df.Administration = mas.fit_transform(df[['Administration']])

In [40]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527  471784.10    Dhaka  192261.83
1         0.983359        0.828805  443898.53      Ctg  191792.06
2         0.927985        0.553781  407934.54  Rangpur  191050.39
3         0.873136        0.649738  383199.62    Dhaka  182901.99
4         0.859438        0.500378  366168.42  Rangpur  166187.94

In [41]:
df.Transport = mas.fit_transform(df[['Transport']])

In [42]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94

In [43]:
df.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

In [44]:
mas = df.drop(['Area','Profit'],axis=1)

In [46]:
mas.head()

   Marketing Spend  Administration  Transport
0         0.692617        0.749527   1.000000
1         0.983359        0.828805   0.940893
2         0.927985        0.553781   0.864664
3         0.873136        0.649738   0.812235
4         0.859438        0.500378   0.776136